tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
# Official Amazon AWS command-line interface
brew "awscli"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Database version control to control migrations
brew "flyway"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10", link: false
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Utility for managing network connections
brew "netcat"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Python dependency management tool
brew "pipenv"
# Object-relational database system
brew "postgresql@14", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Tool to build, change, and version infrastructure
brew "terraform"
# JavaScript package manager
brew "yarn"